/* eslint-disable no-unused-vars */
// --------------------------------------------------------------------------
// 📌 배열의 메서드(Array's Methods)
// --------------------------------------------------------------------------

const JS_학습_주제 = ['변수', '함수', '조건문', '객체', '배열', '비교 연산자', '부정 연산자']

// 배열 항목 위치(index) 찾기(find)
let 함수_인덱스, 비교_연산자_인덱스

함수_인덱스 = JS_학습_주제.indexOf('함수') // 기대값: 1 / 결과값: ?
// console.log('함수_인덱스 =', 함수_인덱스)
함수_인덱스 = JS_학습_주제.indexOf('함 수') // 기대값: -1 / 결과값: ?
// console.log('함수_인덱스 =', 함수_인덱스)

비교_연산자_인덱스 = JS_학습_주제.indexOf('비교')
// console.log('비교_연산자_인덱스 =', 비교_연산자_인덱스) // 기대값: -1 / 결과값: -1

비교_연산자_인덱스 = JS_학습_주제.indexOf('비교연산자')
// console.log('비교_연산자_인덱스 =', 비교_연산자_인덱스) // 기대값: -1 / 결과값: -1

비교_연산자_인덱스 = JS_학습_주제.indexOf('비교 연산자')
// console.log('비교_연산자_인덱스 =', 비교_연산자_인덱스) // 기대값: 5 / 결과값: 5

// indexOf() 메서드의 결과 값을 불리언 값으로 변경하려면?

const fruitBasket = ['패션후르츠', '애플망고', '워터멜론', '오렌지']

// indexOf() 메서드가 반환한 값이 -1보다 크다면? 그 값은 true이다.
// console.log(fruitBasket.indexOf('패션') > -1) // false
// console.log(fruitBasket.indexOf('패션후르츠') > -1) // true
// console.log(fruitBasket.indexOf('애플망고') > -1) // true
// console.log(fruitBasket.indexOf('워터멜론') > -1) // true
// console.log(fruitBasket.indexOf('오렌지') > -1) // true
// 배열.indexOf(값): 불리언

// 구문이 긴데? 재사용 가능한 함수로 작성해볼까요?
// 배열.indexOf(값): 불리언

// function hasItem(array, value) {
//   return array.indexOf(value) > -1
// }

// const hasItem = function (array, value) {
//   return array.indexOf(value) > -1
// }

// const hasItem = (array, value) => {
//   return array.indexOf(value) > -1
// }

// const hasItem = (array, value) => array.indexOf(value) > -1
const hasItem = (array, value) => 
  array.indexOf(value) > -1

console.log(hasItem(fruitBasket, '패션')) // 기대값: false
console.log(hasItem(fruitBasket, '오렌지')) // 기대값: true

// indexOf() 메서드 대신, includes() 메서드 활용
// console.log(fruitBasket.includes('워터멜론'))
// console.log(fruitBasket.includes('수박'))

// 객체 타입(함수, 배열, 객체)은 indexOf()로 판별 가능하지 않음
const 멋사14기_수강생 = [
  {이름: '홍민영'}, // 0
  {이름: '윤정화'}, // 1
  {이름: '허시온'}, // 2
]

// console.log(멋사14기_수강생.indexOf({이름: '홍민영'})) // -1
멋사14기_수강생.findIndex((수강생) => 수강생.이름 === '홍민영') // 0

//------------------------------------------------------------

//배열에 항목 추가

console.log(멋사14기_수강생)
//1.시작의 위치에 새항목 추가 
{
const result = 멋사14기_수강생.unshift({이름: '차지현'})
console.log({length, 멋사14기_수강생})
}

멋사14기_수강생.push({ 이름: '조선현' }, { 이름: '김민지' });

// 중간 위치는 나중에 진행 예정. 



//배열 항복 제거

const counts = [101, 201, 301, 501];
console.log({ counts });

// 1. 처음 위치 항목 제거
const removedFirstItem = counts.shift();
console.log({ removedFirstItem }); // 101
console.log({ counts });           // [201, 301, 501]

{
  //여러항복을 순차적으로 제거 
  console.log(멋사14기_수강생) //5개
  
 const cha = 멋사14기_수강생.shift();
const hong = 멋사14기_수강생.shift();
console.log(cha);  // { 이름: '차정훈' }
console.log(hong); // { 이름: '홍민영' }
console.log(멋사14기_수강생); // 남은 3명
}

//2. 끝 위치 항복 제거 
const numbers = [9, 10, 3, 4, 7, 8]
// 추가 및 제거 방법을 사용해 아래 결과를 만들어 보세요.
// [1, 2, 3, 4, 5, 6]

numbers.shift();
numbers.shift();

numbers.pop();
numbers.pop();

numbers.unshift(2);
numbers.unshift(1);

numbers.push(5);
numbers.push(6);

console.log(numbers); // [1, 2, 3, 4, 5, 6]

// 중간 위치 어딘가에 새 항복을 추가하기 

numbers.splice(2, 2, 100, 122, 1203);

console.log(numbers); // [1, 2, 100, 5, 6]

//배열 복제 
