// --------------------------------------------------------------------------
// ✅ 나머지 매개변수 타입 지정
// --------------------------------------------------------------------------

// 연습문제 1
// `joinStrings`라는 함수를 만들어 보세요.
// 이 함수는 임의 개수의 문자열 인자를 받아, 모두 하나의 문자열로 이어 붙여 반환해야 합니다.
// 예시: joinStrings('안녕!', ' ', '타입스크립트')는 '안녕! 타입스크립트'를 반환해야 합니다.


// 연습문제 2
// `multiply`라는 함수를 만들어 보세요.
// 이 함수는 첫 번째 인자로 곱할 값을 받고, 그 뒤로 임의 개수의 숫자 인자를 받아 각각을 곱한 결과를 배열로 반환해야 합니다.
// 예시: multiply(2, 1, 2, 3)은 [2, 4, 6]을 반환해야 합니다.
